{
    "Title": "ONEROOT DEX — A safe and efficient decentralized exchange",
    "Line": "Line",
    "SelectUnit": {
        "1": "min",
        "5": "min",
        "15": "min",
        "10": "min",
        "30": "min",
        "60": "hour",
        "120": "hours",
        "240": "hours",
        "360": "hours",
        "720": "hours",
        "D": "day",
        "W": "week"
    },
    "Asset": {
        "ActionType": "Type",
        "Approve": "Approve",
        "ApproveAuth": "Approve",
        "ApproveDialog1": "Dear user:",
        "ApproveDialog2": "Your authorization is needed for R1 Protocol to deposit {token} to ONEROOT DEX through {token}'s smart contract for the first time.",
        "ApproveDialog3": "This operation is to allow the transfer of your token to ONEROOT DEX without changing the ownership, and your assets are still under your control.",
        "ApproveMessage": "Now approve {token}'s deposit quota to ONEROOT DEX",
        "ApproveSuccess": "Approved",
        "ApproveTransaction": "Approve transaction",
        "Balance": "Balance",
        "Coin": "Coin",
        "Date": "Date",
        "DenyAuth": "Deny",
        "Deposit": "Deposit",
        "DepositCallbackContent": "The deposit arriving time depending on Ethereum network and usually needs 3 ~ 5 minutes to confirm",
        "DepositSuccessful": "Deposit succeed",
        "DepositFailed": "Deposit failed",
        "DepositTransaction": "Deposit transaction",
        "EnterTheDepositAmount": "Enter the deposit amount",
        "EnterWithdrawAmount": "Enter the withdrawal amount",
        "Gas": "Gas",
        "GasFee": "Gas Fee",
        "GasPrice": "Gas Price",
        "HideAssets": "Hide assets",
        "HideZeroAssets": "Hide small amount assets",
        "HistoryStatus:-1": "Failed",
        "HistoryStatus:0": "Pending",
        "HistoryStatus:1": "Success",
        "HistoryStatus:2": "Processing",
        "MinWithdrawAmount": "Minimum withdrawal amount (equivalent)",
        "MinWithdrawAmountError": "Withdrawal amount could not less than minimum withdraw amount",
        "MinOrderAmount": "Minimum order amount",
        "MyAssets": "My assets",
        "NotEnoughEthInWalletAndDepositFailed": "Deposit action need ETH as gas fee, please keep enough ETH in your wallet",
        "NowDeposit": "Now you are depositing {value}{token} to ONEROOT DEX",
        "NowWithdraw": "Now you are withdrawing {value}{token} from ONEROOT DEX",
        "InsufficientRootrexFunds": "Insufficient funds",
        "InsufficientFunds": "Insufficient funds",
        "PleaseInputKeywordOfTheCoin": "Please input keyword of the coin",
        "QueryQuota": "Now querying token's quota,please wait",
        "RootrexAvailable": "ONEROOT DEX Available",
        "RootrexAvailableBalance": "ONEROOT DEX Available Balance",
        "RootrexFrozen": "ONEROOT DEX Frozen",
        "ShowAssets": "Show assets",
        "Status": "Success",
        "Value": "Value",
        "WalletBalance": "Wallet Balance",
        "Withdraw": "Withdraw",
        "WithdrawSuccessful": "Withdraw submitted",
        "WithdrawFailed": "Withdraw failed",
        "WithdrawTransaction": "Withdraw transaction",
        "SystemRefund": "System Refund",
        "ForceWithdraw": "Force Withdraw"
    },
    "Gas": {
        "AboutGas": "Fees",
        "Title": "As with other exchanges, transactions on ONEROOT DEX are subject to fees, which are separated into trade fee and Gas fee. Trade fee is the fee charged by ONEROOT DEX when the transaction is successful. Gas fee is the fee charged by Ethereum network when utilizing the Ethereum chain for usages such as deposit, withdrawal and transaction.",
        "DealFee": "Trade Fee",
        "DealFeeDetails1": "There are two types of fees incurred during the order transaction: 1) a small amount of tokens paid to ONEROOT DEX as a transaction service fee; 2)The transaction process is carried out on Ethereum and Gas fee is needed to be paid to the Ethereum chain. Both fees are deducted from the tokens received by users.",
        "DealFeeDetails2": "Maker : 0.1% transaction service fee(deducted from the asset received) <br>Taker : 0.1% transaction service fee(deducted from the asset received)",
        "DealFeeDetails3": "For example: A Maker buys 2,000 RNT at the price of 0.0005ETH, pays 1ETH and gets 2,000 RNT. Then ONEROOT DEX will charge 2,000 * 0.1% = 2RNT from the RNT received by the Maker as transaction service fee. In addition, the Gas fee is also deducted from the RNT received by the Maker.",
        "DealFeeDetails4": "A Taker sells 2,000 RNT at the price of 0.0005 ETH, pays 2,000 RNT and gets 1ETH. Then ONEROOT DEX will charge 1* 0.1% = 0.001ETH from the ETH obtained by the Taker as transaction service fee. In addition, the Gas fee is also deducted from the ETH received by the Taker.",
        "GasFee": "Gas Fee",
        "GasFeeDetails1": "The Ethereum network resources are used to perform actions (transfer, transaction, deposit, execution of contracts,etc.) to avoid intentional attacks and abuses, which requires payment of the corresponding fee from users to the network. This type of fee is referred to as a Gas fee and is paid in ETH.",
        "GasFeeDetails2": "Gas fee = Gas Price * Gas Limit",
        "GasFeeDetails3": "Gas Price: The unit price of Gas is GWei and 1ETH = 1,000,000,000 GWei. The gas price is dynamically adjusted by ONEROOT DEX according to the current condition of Ethereum network(the more users, the higher the Gas Price). The preset Gas Price is current Gas Price + 5 GWei (when Gas Price is less than 30 GWei) or Gas Price * 1.2(when Gas Price is greater than 30 GWei), so as to ensure that the transaction is prioritized by miners.",
        "GasFeeDetails4": "Gas Limit: The maximum amount of Gas users willing to pay to perform an operation. Currently, the asset delivery carried out by R1 contract requires 300,000 Gas.",
        "GasFeeDetails5": "According to the executable operations of ONEROOT DEX users, Gas fees may be incurred for the following:  deposit Gas fee, withdrawal Gas fee and transaction Gas fee.",
        "DepositGasFee": "1. Deposit Gas Fee",
        "DepositGasFeeDetails": "Users need to transfer the tokens from wallet accounts to ONEROOT DEX before the transaction can take place, which is conducted on the chain and requires a small amount of ETH to pay to Ethereum network as Gas fee. Please note that there needs to be a small amount of ETH in users’ wallet account to conduct deposit operation.",
        "DealGasFee": "2. Transaction Gas Fee",
        "DealGasFeeDetails1": "The actual delivery of assets between buyers and sellers is conducted on the chain, executed by R1 contract and submitted to Ethereum network, thus generating Transaction Gas Fee. The gas fee is shared by Taker and Maker, deducted from the assets received. Considering that Maker is the provider of liquidity, Maker assumes 30% and Taker 70%.",
        "DealGasFeeDetails2": "Maker : Transaction Gas Fee * 30% / Gas fee conversion rate（asset received)<br>Taker : Transaction Gas Fee * 70% / Gas fee conversion rate（asset received）",
        "DealGasFeeDetails3": "Gas fee conversion rate depends on fluctuation of tokens, current rate : ETH is 100%, and other tokens are 50%.",
        "DealGasFeeDetails4": "",
        "DealGasFeeDetails5": "",
        "DealGasFeeDetails6": "",
        "withdrawGasFee": "3. Withdrawal Gas Fee",
        "withdrawGasFeeDetails1": "Users can withdraw their assets from ONEROOT DEX Balance to their wallet accounts at any time. The withdrawal process is conducted on the chain, which requires payment of a small amount of ETH as Gas fee to Ethereum.",
        "withdrawGasFeeDetails2": "For user convenience, ONEROOT DEX automatically extracts part of the crypto assets withdrawn by users and converts them to ETH to be paid. Therefore, there’s no need to deposit ETH in the exchange assets in advance.",
        "withdrawGasFeeDetails3": "",
        "SumOrderAmount": "Minimum Order Amount",
        "SumOrderAmountDetails1": "It will cost Taker a great deal of Transaction Gas fees if the order amount sent by Maker is too small. Therefore, ONEROOT DEX limits the minimum amount of orders.",
        "SumOrderAmountDetails2": "Minimum Order Amount = Gas Price * 200,000 (Gas Limit of R1 Protocol) * 70% ( Proportion of Gas fee undertaken by Taker) / 2%",
        "SumOrderAmountDetails3": "Minimum Transaction Amount = Minimum Order Amount * 50%",
        "SumOrderAmountDetails4": "The order with a balance less than the minimum transaction amount will be canceled automatically and the balance will be returned to protect Taker’s interest.",
        "SumWithdrawAmount": "Minimum Withdrawal Amount",
        "SumWithdrawAmountDetails1": "Gas fee will be generated from withdrawal and thus ONEROOT DEX sets a minimum withdrawal amount.",
        "SumWithdrawAmountDetails2": "<p>Minimum Withdrawal Amount = Gas Price * Gas Amount(150,000) / Gas fee conversion rate / 8%. </p> The request will be prohibited if a single withdrawal amount is less than the minimum withdrawal amount. Users can deposit assets until the value is equal or higher than the minimum withdrawal amount to initiate the withdrawal."
    },
    "AboutRootrex": {
        "Introduction": "《About ONEROOT DEX》",
        "Update": "Last updated time：2018.6.20",
        "Overview": "Overview",
        "OverviewDetails": "ONEROOT DEX is a decentralized exchange based on ETH smart contract. Compared with traditional exchanges like EtherDelta, ONEROOT DEX carries a relay service. Therefore, while guaranteeing security of the users’ asset, ONEROOT DEX is able to provide a high transaction velocity and pleasant trading experience comparable to the centralized exchange.",
        "WorkingMechanism": "Trade",
        "Deposit": "Deposit",
        "DepositSteps": "Through ONEROOT DEX Wallet (for mobile) or MetaMask plug-in (for PC), users can transfer the tradable ERC-20 asset (when finishing registration for coin-to-coin transaction on ONEROOT DEX) to the ONEROOT DEX smart trading contract. Each individual wallet will have one and only ONEROOT DEX trading account. ",
        "Transaction": "Transaction",
        "TransactionSteps": "The order signed by the user will be sent to the ONEROOT DEX relay service. After the signature is verified, the order will go through the matching procedure in the relay server. Once the matching conditions are fulfilled, the transaction will be carried out by the smart contract and settled on the blockchain.",
        "Withdrawal": "Withdrawal",
        "WithdrawalSteps": "Request for withdrawal will be examined by ONEROOT DEX relay. ONEROOT DEX relay will then update and confirm the asset and order status of the concerned account and will initiate request for withdrawal to the smart contract after the information is checked. The asset will be withdrawn to the corresponding wallet address of the account (the address which made the deposit, others are invalid).",
        "AssetsSecurity": "How does ONEROOT DEX protect the security of users’ asset?",
        "AssetsSecurityIntroduce": "Users’ trading assets are stored in ONEROOT DEX smart contract and only the authorized administrators have access to the contract. Besides, all the operations on the users’ asset requires a verification of user signature, and any tampered data will not be verified. The withdrawal from account is also allowed to return only to the original wallet address.",
        "Fees": "Fees",
        "CommissionFee": "Commission fee",
        "FeesDetails": "There is no commission fee.",
        "TransactionFee": "Transaction fee",
        "Maker": "Maker: {{feeRate}} transaction fee(deducted from the asset received) plus Gas fee * {{makerGasRate}} (deducted from the asset received) / Gas fee conversion rate（asset received）",
        "Taker": "Taker: {{feeRate}} transaction fee (deducted from the asset received) plus Gas fee * {{takerGasRate}} (deducted from the asset received) / Gas fee conversion rate（asset received）",
        "TokenValue": "Gas fee conversion rate depends on fluctuation of tokens, current rate  : ETH and TUSD are 100%, and other tokens are 50%.",
        "Popularize": "During the promotion period of ONEROOT DEX, the transaction fee for both Maker and Taker will be {{feeRate}} and only Gas fee will be charged.",
        "WithdrawalFee": "Withdrawal fee",
        "WithdrawalDetails": "No fee will be generated from a withdrawal but a Gas fee will be charged in advance (deducted from the asset received).",
        "GasWhat": "What is a Gas fee?",
        "GasDetails": "The actual delivery of buyers’ and sellers’ asset is accomplished on the blockchain, carried out by ONEROOT DEX contract and uploaded to the ETH network. Then a Gas fee will be generated.<br>In the transaction, the taker will afford the Gas fee which is deducted from the asset received.<br>Similarly, Gas fee will also be generated from withdrawal and be deducted from the asset withdrawn. ",
        "GasFee": "Gas fee = Gas * GasPrice",
        "Gas": "Gas is decided by the trading contract with slight variation. Currently the asset delivery carried out by ONEROOT DEX contract requires 200,000 gas.",
        "GasPrice": "GasPrice is the unit price of Gas, which is dynamically adjusted by ONEROOT DEX relay according to present Ethereum network conditions. The preset Gas Price is the current Gas Price plus 5 GWEI(When Gas Price < 30 GWEI) or Gas Price * 1.2(When Gas Price >= 30 GWEI), so as to guarantee that the transaction will be recorded by the miner with priority.",
        "EntrustAmount": "Minimum order amount",
        "MakerAmount": "If the order amount sent by the Maker is too small, a great deal of Gas fee will be generated. Therefore, it is regulated in ONEROOT DEX that the amount of the order follows an equation.",
        "SubAmount": "Minimum Order Amount = Gas Price * Gas Amount({{tradeGas}}) * Proportion of Gas fee undertaken by Taker ({{takerGasRate}}) / {{orderLimitCoefficient}}, Minimum Transaction Amount = Minimum Order Amount * 0.5",
        "TailQuantity": "The order with a balance less than the minimum amount*0.5 required will be canceled automatically and the balance will be returned to protect Taker’s benefit.",
        "WithdrawalAmount": "Minimum withdrawal amount",
        "WithdrawalAmountDetails": "Gas fee will be generated from withdrawal and thus ONEROOT DEX relay sets a minimum withdrawal amount. Minimum Withdrawal Amount = Gas Price * Gas Amount({{withdrawGas}}) / Gas fee conversion rate / {{tokenValue}}, The request will be prohibited if a single withdrawal amount is less than the minimum withdrawal amount (and equivalence). Users can top up the asset until the value is equal or higher than the minimum withdrawal amount to initiate the withdrawal.",
        "PrivateKey": "How can my private key be secured?",
        "PrivateKeyIntroduction": "ONEROOT DEX will not keep a copy of users’ private key, and all the signature will be accomplished in ONEROOT DEX App or MetaMask. Please keep your private key secure from other people and Internet.",
        "ROOTREXAPP": "ONEROOT DEX App",
        "ComingSoo": "Downloads",
        "ContactUs": "Contact Us",
        "email": "contact@oneroot.io"
    },
    "Common": {
        "All": "All",
        "Dark": "Dark",
        "Detail": "Detail",
        "DownloadClient": "Download App",
        "FullScreen": "Full Screen",
        "Light": "Light",
        "Loading": "Loading",
        "More": "More",
        "NoData": "No Data",
        "Ok": "Ok",
        "Operation": "Operation",
        "R1Protocol": "R1 Protocol",
        "Reset": "Reset",
        "Search": "Search",
        "Search2": "Search",
        "Skin": "Skin",
        "Status": "Status",
        "Time": "Time",
        "Title": "ONEROOT DEX - Safe and efficient decentralized exchange",
        "Version": "Version"
    },
    "Download": {
        "page1Title": "ONEROOT DEX— A world leading decentralized exchange ",
        "page1Subtitle": "As a prototype of the distributed decentralized exchange based on R1 Protocol, ONEROOT DEX can provide you with the ultimate trading experience with asset security, trading transparency and matching efficiency. ",
        "page2Title": "Asset security",
        "page2Content": "The problem of security is always the Sword of Damocles for everyone. The centralized exchanges are frequently targeted by the hackers because of their accumulation of assets.",
        "page2Contents": "The assets of the ONEROOT DEX users are deposited in the smart contract and controlled independently by the users themselves. Even if the exchange is under attack, there is no risk of asset loss, which guarantees the asset security.",
        "page3Title": "Trading transparency",
        "page3Content": "Each transaction record of ONEROOT DEX is kept on the blockchain while related trading details and fee deductions are also transparent. Each transaction through R1 Protocol is verifiable and traceable. Once submitted onchain, it is authentic, reliable and inalterable. In this way, human intervention (e.g. black box operation and transaction rollback) can be prevented radically.",
        "page4Title": "Perfect privacy protection",
        "page4Content": "Different from the fussy register procedure of centralized exchange, ONEROOT DEX requires neither registration nor KYC. You can use ONEROOT DEX at any time with just a Ethereum wallet address, which protects the user privacy perfectly.",
        "page5Title": "Shared liquidity",
        "page5Content": "Similar to ONEROOT DEX, all distributed decentralized exchanges will be connected to R1 Protocol, so as to achieve the shared transaction flow as well as provide the users with better transaction depth and higher asset liquidity.",
        "page6Title": "Fluent experience",
        "page6Content": "ONEROOT DEX innovatively separates the matching and execution of orders. By finishing the order matching in the background, the trading experience of the decentralized exchange is improved to a level comparable to that of the centralized exchange.",
        "page7Title": "Transaction fairness",
        "page7Content": "By finishing the order matching in the background, ONEROOT DEX can stick to the principle of “first order, first deal”. With the trading mechanism of smart contract, malicious order competence by raising gas, the common problem of decentralized exchange, can be prevented effectively, and thus the transaction fairness is guaranteed.",
        "page8Title": "Professional K Line"
    },
    "Footer": {
        "AboutRootrex": "ABOUT ONEROOT DEX",
        "Contact": "CONTACT",
        "Terms": "TERMS OF SERVICE",
        "Privacy": "PRIVACY POLICY",
        "Fees": "FEE",
        "ApplyToList": "APPLY TO LIST",
        "DataSource": "Data Source",
        "CustomerSupport": "Customer Support(1)",
        "CustomerSupports": "Customer Support(2)",
        "Inves":"Investment involves risks   Be cautious when conducting transactions"
    },
    "Header": {
        "AboutRootrex": "About ONEROOT DEX",
        "AppDownload": "Download App",
        "Asset": "Assets",
        "AssetsHistory": "D&W History",
        "ChangeNetworkToKovan": "Please Change To Kovan Network",
        "ChangeNetworkToMain": "Please Change To Main Network",
        "ClickToCopyAddress": "Click to copy your address",
        "Copied": "Copied",
        "Help": "Fee",
        "Home": "Home",
        "MyAssets": "My Assets",
        "Notice": "Announcement",
        "Novice": "Guide",
        "OpenOrders": "Open Orders",
        "Order": "My Order",
        "OrderHistory": "Order History"
    },
    "Help": {
        "BeginnerHelp": "Guidance",
        "RiskNotice": "Risk Alert",
        "InstallMetaMask": "Install MetaMask",
        "Use": "Use MetaMask",
        "Sign": "Signature",
        "Deposit": "Deposit",
        "Withdraw": "Withdrawal",
        "BuyAndSell": "Buy & Sell",
        "RateDescription": "Rate",
        "RiskNoticeContent": "There are extremely high risks in the digital currency transaction (pre-excavation, sudden rise and drop, banker manipulation, team dissolution, technical defects and etc.). ONEROOT DEX only provides a free online exchange platform for the digital currency lovers, and will not take any responsibility of examination, guarantee and compensation for the coin investment value. You will take full responsibility for your investment losses, so please do not conduct and transaction if you cannot accept the risks.",
        "MetaMaskIntroduce": "MetaMask is a reliable Ethereum wallet based on the form of browser plug-in, supported by Chrome, Firefox and Opera. It can manage your Ethereum wallet in the browser and communicate with ONEROOT DEX to complete the transactions.",
        "OfficialWebsite": "Official website",
        "Install": "Installation",
        "Github": "4.<a href='https://github.com/MetaMask/metamask-extension/releases' target='_blank'>Download</a> the installer from the official Github and extract it.",
        "InputClrome": "Enter chrome://extensions/ in Chrome, press enter.",
        "Open": "For Chrome version 67 and beyond, click the “Developer mode” on the top right corner; for Chrome version below 67, go directly to step 4. To check the version, visit chrome://settings/help. ",
        "DragAndDrop": "Drag the extracted document to Chrome.",
        "Firefox": "Install from the official plug-in store of Firefox <a href='https://addons.mozilla.org/zh-CN/firefox/addon/ether-metamask/?src=search' target='_blank'>Click here</a>",
        "Opera": "Install from the official plug-in store of Opera <a href='https://addons.opera.com/zh-cn/extensions/details/metamask/' target='_blank'>Click here</a>",
        "Or": "Or",
        "InstallEnd": "Refresh the page after installation",
        "SetupMetaMask": "Click MetaMask plug-in unit, set passwords, import existing wallet and start transaction.",
        "OpenMetamask": "There will appear a privacy alert when the users open MetaMask for the first time after installation. Click Accept.",
        "NextMetaMask": "Then comes the term of use. Scroll to the end and click Accept.",
        "NewlyBuild": "Create a new wallet or import existing wallet. Take importing existing wallet for example, click Import Existing DEN.",
        "InputWallet": "Then enter the mnemonic words of your wallet and set the MetaMask password to finish the import.",
        "PrivateKey": "Later you can also import existing wallet by private key or JSON File.",
        "SignContent": "Signatures are needed every time the user conducts crucial operations. The server will verify the signature validity to ensure the credibility of transaction, for example, the commission order (buy & sell).<br/>The signature is an offline behavior, so it will not cost and ETH or Token.<br/>Note: Asset deposit will be accomplished in the form of transaction, and only deposit will initiate transaction and cost Gas.",
        "DepositContent": "On the page of My Asset, click Deposit and enter the amount of deposit. Then click Deposit and sign in the MetaMask dialog to finish deposit.<br/>Note: One authorization is needed when depositing ETH for the first time, and two authorizations needed when depositing Token for the first time.",
        "WithdrawContent": "On the page of My Asset, click Withdraw and enter the amount of withdrawal. Then click Withdraw and sign in the MetaMask dialog to finish withdrawal.",
        "BuyAndSellContent": "Users can trade after entering price and unit for certain trading couple.",
        "RateDescriptionContent": "Please refer to",
        "RateDescriptionContent_Two": "《About ONEROOT DEX》"
    },
    "MetaMask": {
        "ClickToInstallMetaMask": "Click to install MetaMask",
        "ClickToUnlockMetaMask": "Unlock MetaMask",
        "OperateSuccessful": "Operate succeed",
        "OperateFailed": "Operate failed",
        "PleaseInstall": "Please install MetaMask first",
        "PleaseInstallOrLogin": "Please unlock/install MetaMask first",
        "PleaseLogin": "Please unlock/install MetaMask first",
        "Sign": "Sign",
        "UseMetaMaskToFinish": "Please use MetaMask to finish",
        "Install": "Please install METAMASK first",
        "MetamaskDetails": "METAMASK is a trusted Ethereum wallet browser plugins, and  it supportsChrome, Firefox and Opera. It can manage your Ethereum wallet in the browser and communicate with ONEROOT DEX to complete the transaction.",
        "Official": "Official website:",
        "InstallMetaMask": "Install",
        "Affter": "After the installation, close the browser and reopen it. Go to oneroot.io. ",
        "ClickMetaMask": "Click the MetaMask plug-in, set the passwords, import existing wallet and start the transaction."
    },
    "Notice": {
        "LatestAnnouncement": "Latest Announcement",
        "NewCoinList": "New Coin Listing",
        "NoticeCenter": "Announcement",
        "ViewAllLatestAnnouncement": "View All Latest Announcement",
        "ViewAllNewCoinList": "View All New Coin List",
        "KongList":"Announcement of air drop activity",
        "Other":"Other announcements",
        "ViewKongList":"Check out all the airdrop announcements",
        "ViewOther":"View all other bulletin articles"
    },
    "Paginator": {
        "First": "First",
        "Last": "Last",
        "GoTo": "GoTo",
        "PerPage": "Per-Page",
        "Row": "Row"
    },
    "Rootrex": {
        "Amount": "Amount",
        "AmountTooSmall": "Order amount can not be less than {amount} {token}",
        "Buy": "Buy",
        "BuyAndSell": "Buy/Sell",
        "BuyIn": "Buy",
        "BuyMessage": "Now you are buying {volume} {token} at unit price: {price} {base}",
        "Cancel": "Cancel",
        "CancelAll": "Cancel All",
        "CancelFailed": "Cancel Failed",
        "CancelSuccessful": "Cancel Submitted",
        "Fee": "Fee",
        "LimitBuy": "Buy",
        "LimitOrder": "Limit Order",
        "LimitSell": "Sell",
        "LimitTrade": "Limit Order",
        "OrderAlarm": "Warning",
        "OrderAlarmBuy": "Your price is 150% higher than current price,confirm?",
        "OrderAlarmSell": "Your price is 50% less than current price,confirm?",
        "OrderAlarmConfirm": "Yes,I confirm",
        "OrderAlarmDeny": "No",
        "OrderTransaction": "Transaction",
        "OutOfBalance": "Out of {token}",
        "Price": "Price",
        "Sell": "Sell",
        "SellMessage": "Now you are selling {volume} {token} at unit price: {price} {base}",
        "SellOut": "Sell",
        "Total": "Total",
        "TotalVolume": "Sum",
        "Trade": "Trade",
        "Trades": "Last 20 Trades",
        "TransactionDetail": "Transaction detail",
        "TransactionFailed": "Failed",
        "TransactionSuccessful": "Order Placed",
        "Kline": "Candles",
        "Depth": "Depth",
        "Groups": "Group",
        "Decimal": "Decimals",
        "OrderDetail": "Order detail",
        "OrderDate": "Date",
        "Type": "Type",
        "OrderPrice": "Order Price",
        "UnitPrice": "Price",
        "AvgPrice": "Avg Price",
        "OrderAmount": "Order Amount",
        "TradeAmount": "Filled Amount",
        "TradeVol": "Trade Vol",
        "OrderStatus:-6": "Canceling",
        "OrderStatus:-5": "Finished",
        "OrderStatus:-4": "Abnormal",
        "OrderStatus:-3": "Canceled",
        "OrderStatus:-2": "Expired",
        "OrderStatus:-1": "Failed",
        "OrderStatus:0": "Opening",
        "OrderStatus:1": "Finished",
        "OrderStatus:2": "Confirming",
        "TradeStatus:-4": "Abnormal",
        "TradeStatus:-3": "Tail returned",
        "TradeStatus:-2": "Expired",
        "TradeStatus:-1": "Failed",
        "TradeStatus:0": "Pending",
        "TradeStatus:1": "Success",
        "TradeStatus:2": "Processing",
        "TradeStatus:3": "Pending",
        "Interrupt": "Interrupt"
    },
    "Symbol": {
        "24hChange": "24h Change",
        "24hHigh": "24h High",
        "24hLow": "24h Low",
        "24hVolume": "24h Vol",
        "High": "H",
        "Low": "L",
        "Marked": "Favorite",
        "Market": "Market",
        "MarketPrice": "Price",
        "Pair": "Pair",
        "Pair2": "Pair",
        "Volume": "V"
    },
    "SetUp": {
        "Setup": "Set",
        "Currency": "Currency",
        "Language": "Language",
        "Theme": "Theme",
        "Dark": "Dark",
        "Light": "Light"
    },
    "Service": {
        "Agreement": "ONEROOT DEX User Agreement",
        "Definition": "I. Definitions",
        "DefinitionDetails": "By using any of the services ONEROOT DEX offers, the ONEROOT DEX website (www.oneroot.one) or ONEROOT DEX API, you will be considered to have read, understood, and agreed to the following clauses and conditions.<br>“cryptocurrency”, “asset”, “digital asset”, “distributed ledger”, “smart contract”, “token”, and “coin” are all basic terminology relating to blockchain.",
        "AgreementContent": "II. Agreement contents and signatures",
        "AgreementContent_One": "1. The content of this Agreement, including the main body and all of the rules of various types that have already been released or may be released in the future by ONEROOT DEX; all rules are inseparable components of the Agreement and bear the same legal force as the main body of the Agreement. Unless otherwise clearly stated, all of ONEROOT DEX services are subject to the restrictions in this Agreement.",
        "AgreementContent_Two": "2. Before using ONEROOT DEX services, you should carefully read the contents of the whole Agreement; if you have any questions about the Agreement, please consult ONEROOT DEX. However, regardless of whether you have read this Agreement, by using ONEROOT DEX services, you are bound by this Agreement; when the time comes, you should not maintain that this Agreement is invalid or request the cancellation of this agreement on the basis that you have not read the contents of this Agreement or have not received an answer to your question.",
        "AgreementContent_Three": "3. You agree to accept and comply with the terms of this Agreement. If you do not agree to the terms of this Agreement, you should immediately stop importing into the Ethereum wallet or stop using ONEROOT DEX services.",
        "AgreementContent_Four": "4. ONEROOT DEX has the right to formulate or amend this Agreement and the various types of rules at any time when the need arises and announce these publicly using notifications on the website, without informing you on an individually. Changes to the Agreement or rules will come into force immediately after they have been announced on the website. If you do not agree to the related changes, you should stop using ONEROOT DEX services immediately. Your continued use of ONEROOT DEX services indicates that you accept the formulated or amended Agreement and rules.",
        "UseNotice": "III. Usage and Notifications",
        "UseQualifications": "1. Eligibility for use",
        "UseQualificationsDetails": "Please confirm when you use ONEROOT DEX services that you are actually using them in the permitted manner; you should have full capacity of civil rights and full capacity for civil conduct and be a natural person, legal entity or other organization. You must be eighteen years old or over to visit or use our services; even if you have gained the agreement of a legal guardian, if you do not meet the aforementioned requirements for eligibility, you and your guardian will bear liability for any consequences thereof.",
        "Jurisdiction": "2. Jurisdiction and Notifications",
        "JurisdictionDetails_One": "ONEROOT DEX does not provide an account system so users do not need to register but carry out transactions by creating or importing a Ethereum wallet. Under the prerequisite of abiding by these service clauses, ONEROOT DEX grants you limited, non-exclusive, non-transferable, and completely revocable permit to visit or use ONEROOT DEX services. Your usage of the service applications is non-commercial, which means you must not transfer ownership of, donate or bequeath to any person account passwords or any permissions relating to the services; ONEROOT DEX does not bear liability for direct or indirect losses or unfavorable consequence resulting from any such action.",
        "JurisdictionDetails_Two": "All of ONEROOT DEX's notifications and information (including but not limited to the formulation or amendment of, additions to, or removals from the Agreement or rules) will be made publicly known at (www.oneroot.io) and will come into force immediately after being made publicly known, without informing you individually. It is your responsibility to check for notifications and information. If you continue to use ONEROOT DEX services after changes have been made, this means you have accepted and agreed to the changes. In addition, your continued use means you agree that all your subsequent trading will be bound by the newest restrictions listed on the website. If you do not agree to any amendments or changes to these clauses, you can revoke your agreement by halting usage of services.",
        "Security": "III. Security",
        "SecurityDetails": "You must take responsibility for the security of any equipment used with the Ethereum wallet or services and ensure no unauthorized person accesses your Ethereum wallet or any equipment you use for of the services. You will bear the related liability for all activities taking place at the wallet address (including but not limited to information disclosure, release of information, online agreement or submission of any types of rule or agreement, online signing of agreements or purchase of services etc.).",
        "RootrexService": "IV. ONEROOT DEX Services",
        "ServiceDescribe": "1. Description of services",
        "ServiceDescribeDetails_One": "At the current stage, ONEROOT DEX offers a safe, convenient platform for the exchange of digital assets via the Ethereum Network. Using ONEROOT DEX services, users can enquire about digital asset prices, release trade information, reach trading agreements, and complete asset transactions.",
        "ServiceDescribeDetails_Two": "Users’ assets are saved in ONEROOT DEX smart contracts and authorized ONEROOT DEX services exchange these assets for other assets on the Ethereum Network. You trade digital assets directly with other ONEROOT DEX contract users, with asset exchange rates and amounts determined by the two sides participating in the transaction.",
        "ServiceDescribeDetails_Three": "In the future, ONEROOT DEX services may support users in the trading of their assets with public chain digital assets, but currently only partial asset trade on the Ethereum Network is supported.",
        "Cost": "2. Fees and authorization",
        "CostDetails": "To withdraw, deposit, and trade assets in accordance with the ONEROOT DEX contract, users need to use Ethereum Network resources and therefore generate Gas costs; as a service provider, ONEROOT DEX also charges transaction fees to both parties in an exchange. By agreeing to this clause, you agree to undertake the above costs.",
        "Taxation": "3. Regarding taxes",
        "TaxationDetails": "You are responsible for ensuring taxes are appropriate to all the amounts of your payments and charges and for the proper reporting to the tax authority and remittances of the correct amount of tax. ONEROOT DEX is not responsible for determining taxes collected are appropriate to your transactions, nor whether to collect, report, or exempt any of the taxes generated by transactions.",
        "UseStandard": "V. Usage Standards for ONEROOT DEX Services",
        "UseStandardDetails": "During the process of using ONEROOT DEX services on ONEROOT DEX you should uphold the principles of honesty and trust, promising to abide by the following:",
        "UseStandardDetails_One": "1. All conduct while using ONEROOT DEX services abides by the normative documents of national laws and regulations and the provisions and requirements of each of ONEROOT DEX’s rules and does not contravene society’s public interest or public morals, nor harm the legal rights of others, evade or dodge payable taxes, or breach this Agreement or relevant rules. If you violate the above agreement and any legal consequences occur, legal liability shall be undertaken by you independently, and ONEROOT DEX’s freedom ensured from any loss generated thereof.",
        "UseStandardDetails_Two": "2. Do not take any action constituting unfair competition, do not disturb the normal order of transactions, do not engage in conduct that is unrelated to online transactions. Do not make commercial gain from any of the data on ONEROOT DEX, including but not limited to copying or transmitting any of the material displayed on the ONEROOT DEX website, without first receiving written permission. Do not use any installation, software, or program to interfere with or attempt to interfere with ONEROOT DEX’s normal operation or any transaction or activity in progress on ONEROOT DEX. You must not take any action that causes unreasonably large data loads on ONEROOT DEX services.",
        "UseStandardDetails_Three": "3. Do not provide false, incorrect, or misleading information; do not use or attempt to use the service to harass, abuse, or harm other people or organizations; do not contravene or assist in contravening any applicable law or regulation; do not use ONEROOT DEX services to transfer funds for any activities considered to constitute criminal conduct; do not purposefully try to cheat ONEROOT DEX or ONEROOT DEX users; do not behave in any way that interferes with, intercepts, or expropriates any systems, data, or information; do not transmit or upload any malicious software or programs; do not attempt to gain unauthorized access to Ethereum addresses, websites or any related networks loaded through the ONEROOT DEX; do not use any means to damage the service.",
        "UseStandardDetails_Four": "4. You understand and agree that: ONEROOT DEX has the right to unilaterally identify the nature of your conduct on ONEROOT DEX and whether it constitutes a violation of this Agreement and rules, including conduct that already affects ONEROOT DEX and ONEROOT DEX users though you are not yet on ONEROOT DEX, and to take appropriate measures accordingly without the need to gain your consent or provide you with notification. (Please refer to Usage and Notices) You should save all evidence relating to your conduct yourself and bear liability for any unfavorable consequences if you are unable to provide full evidence. If you are suspected of conduct violating the agreement that causes hard to any third party, you should undertake legal responsibility independently in your own name and ensure that ONEROOT DEX is free from any losses or increased costs generated as a result of this conduct. If you are suspected of violating relevant laws or the rules of this Agreement, causing ONEROOT DEX to sustain losses, be liable for the payment of compensation to any third parties, or be penalized by any administrative departments, you should compensate ONEROOT DEX for such losses caused (or) costs occurring, including reasonable legal costs.",
        "Disclaimer": "VI. Exception Clause",
        "DisclaimerDetails_One": "1. ONEROOT DEX is responsible for providing you with ONEROOT DEX services according to the states of “the current situation” and “availability”. ONEROOT DEX does not give any indication or suggestion, however, of guarantees for ONEROOT DEX services, including but not limited to the usability, freedom from errors or oversights, continuity, accuracy, reliability, or applicability to special uses. Meanwhile ONEROOT DEX does not make any promises or guarantees of the effectiveness, accuracy, validity, reliability, stability, completeness, or timeliness of the technology or information involved in ONEROOT DEX services.",
        "DisclaimerDetails_Two": "2. You understand that the information on ONEROOT DEX is issued by users themselves and risks and shortcomings could exist.",
        "DisclaimerDetails_Three": "3. ONEROOT DEX is only a transaction location and is only a place for obtaining digital asset information, special transactional objects, issuing transaction information, and launching transactions; ONEROOT DEX is, however, unable to control the quality, security, or legality of digital currencies involved in transactions, the authenticity or accuracy of transaction information, or the ability of each party in a transaction to fulfil each of their obligations in their transaction agreement. You should carefully weigh up and determine the authenticity, legality, and effectiveness of relevant digital assets and/or information for yourself and bear the losses or liability generated thereof. ONEROOT DEX is not obliged to examine in advance the information data, digital currency information, transaction behavior, or other relevant transaction matters of all users except when clearly required by laws and regulations, or in the event of the following situations: ONEROOT DEX has reasonable reason to believe that specific addresses and transaction matter may have a grave breach of the law or terms of the contract; ONEROOT DEX has reasonable reason to believe that a user's conduct on ONEROOT DEX is suspected of being illegal or improper.",
        "DisclaimerDetails_Four": "4. Regarding any harm caused or related to the use of ONEROOT DEX services, you understand and agree that ONEROOT DEX does not undertake liability for any of the following situations, this includes but is not limited to direct commercial losses, such as compensation, application, delay, business, or profit losses, business disruption costs, loss of digital assets etc.; losses brought about by computing, computer software, systems and programs and the data on them, or any other direct or indirect harm; intangible losses in the areas of business reputation, usage, or data etc. (regardless of whether ONEROOT DEX has already been notified of the possibility of such damage compensation).",
        "DisclaimerDetails_Five": "5. You understand and agree that ONEROOT DEX does not guarantee to continue or allow for uninterrupted, secure access to any parts of its services, and the operation of services may be disturbed by numerous factors beyond our control. ONEROOT DEX will do its best to reasonably strive to ensure transactions are handled in a timely manner, but we do not make any declarations or guarantees regarding the time needed to complete transactions since the service is dependent on many external factors.",
        "DisclaimerDetails_Six": "6. Under any circumstances, ONEROOT DEX is not liable for its inability to provide services or delay in providing services as a result of normal equipment maintenance of the information network, information network connection problems, computer communication and other system faults, power failure, industrial strikes or disputes, riots, uprisings, disturbances, deficiencies in production capacity or means of production, fire, flooding, storms, explosions, wars, acts of government, orders from judicial and administrative authorities, or third-party inaction.",
        "DisclaimerDetails_Seven": "7. Users of ONEROOT DEX services are responsible for the results of their actions and are responsible for the security of access to services, including but not limited to private keys, passwords, and JSON wallet documents.",
        "DisclaimerDetails_Eight": "8. ONEROOT DEX bears no responsibility under any circumstances for any problem that may be caused by using the Ethereum platform or any problems caused by Ethereum code.",
        "DisclaimerDetails_Nine": "9. You hereby clearly understand and agree that ONEROOT DEX and its subsidiary companies and service providers and their management staff, directors, agents, joint venture enterprises, employees, and representatives will not bear any liability for any indirect, special, accidental, punitive, demonstrative harm because of profit losses, usage, data, or business relating to the use of these services.",
        "AgreementStop": "VII. Termination of Agreement",
        "AgreementStop_ContentOne": "You agree that ONEROOT DEX has full capacity to decide to suspend or terminate part or whole of the ONEROOT DEX services provided to you for whatever reason without prior notification, temporarily or permanently freeze (cancel) your permission of using your Ethereum address to access the ONEROOT DEX and need not bear any responsibility toward you or any third parties.",
        "AgreementStop_ContentTwo": "You agree that if your services have been terminated or your permission of using your Ethereum address to access the ONEROOT DEX has been permanently frozen (cancelled), ONEROOT DEX is not obliged to keep or disclose to you any information from within your account and is also not obliged to forward to you or third parties any unread or sent information.",
        "AgreementStop_ContentThree": "You agree that once your contractual relationship with ONEROOT DEX has ended, ONEROOT DEX still enjoys the following rights: to continue to keep your user information and all the transaction information from the period during which you used ONEROOT DEX services. If there exist illegal conduct or conduct that contravenes this Agreement and/or rules during the period of usage of ONEROOT DEX services, ONEROOT DEX can still assert its rights to you on the basis of this Agreement.",
        "AgreementStop_ContentFour": "If ONEROOT DEX has suspended or terminated the services provided to you, your transaction behavior prior to suspension or termination of services will be handled according to the following principles, you should independently handle and bear complete responsibility for any dispute, losses, or extra costs arising from the following handling and ensure that ONEROOT DEX is free from any losses arising as a result or bearing any costs: ONEROOT DEX has the right to delete information relating to any untraded tokens uploaded to ONEROOT DEX before services were suspended or terminated; ONEROOT DEX has the right to delete the sales contract and information relating to the transaction token, of any unfulfilled sales contract agreed with another member before suspension or termination, but ONEROOT DEX has the right to notify your transaction counterparty of the related circumstances at the time of suspension or termination of services.",
        "Other": "VIII. Legal Application, Jurisdiction, and Others",
        "OtherContent_One": "1. We may not be able to provide you with our services as a result of you place of residence, geographical location, or eligibility criteria. Certain judicial districts do not permit implied warrantee disclaimers, therefore the above disclaimer may not be applied to you. If you live in the following jurisdictions: New York, Washington, North Korea, or Iran, you will not be able to use ONEROOT DEX services.",
        "OtherContent_Two": "2. The force, explanation, changes, execution, and dispute resolution of this Agreement all apply Singaporean law; if there is no relevant legal provision, general international business practices and (or) industry practices should be consulted and followed.",
        "OtherContent_Three": "3. This Agreement includes general standards you must abide by when using ONEROOT DEX services; certain services may apply corresponding specifically formulated standards, if there are discrepancies or conflict between a general standard and specifically formulated standard, the specifically formulated standard will take precedence.",
        "OtherContent_Four": "4. In disputes arising from this Agreement, it is up to the platform to determine the specific objects of dispute according to your use of services, for example, in disputes arising from your use of ONEROOT DEX services, a ONEROOT DEX operator should communicate with you and handle the matter. As soon as a dispute occurs, you and a ONEROOT DEX operator agree that the people’s court in the forum domicile shall be the first court of first instance.",
        "OtherContent_Five": "5. Any rights or provisions in this clause that ONEROOT DEX cannot exercise or execute should not be considered waived.",
        "OtherContent_Six": "6.Please contact us via <a href='contact@oneroot.io' target='_blank'>contact@oneroot.io</a> to report any instances of violation of this user agreement, or if you have any questions relating to this Agreement or services.",
        "Privacy": "IX. Privacy Clause",
        "InformationSources": "1. Information sources",
        "InformationSourcesDetails": "When you use our services, we will collect information about your transactions and/or other activities to analyze trends, manage services, track users’ movements, and collect extensive information on population statistics to supply integrated usage. We may use cookies to find out which aspects of our services are useful, and which need to be improved. We may use web beacons or pixel trackers to find out how you use our services or how to better satisfy our services. For the purpose of preventing fraud, we may continuously collect information about your computer, mobile device, or other equipment, and identify any malware or other activity that might harm ONEROOT DEX or its users.",
        "InformationDisclosure": "2. Information disclosure",
        "InformationDisclosureDetails": "ONEROOT DEX respects and protects the individual privacy rights of all users of ONEROOT DEX services. To provide you with accurate, more personalized services, ONEROOT DEX will use and disclose your personal information in accordance with the provisions of this right of privacy policy, and ONEROOT DEX is obliged to treat this information with a high level of diligence and caution. Except when otherwise stipulated in this right of privacy policy, in situations in which your prior consent has not been obtained, ONEROOT DEX will not externally disclose this information or provide it to a third party.",
        "InformationDisclosureDetails_One": "In the following situations, ONEROOT DEX will partially or fully disclose your personal information in accordance with your individual wishes or legal provisions:",
        "InformationDisclosureDetails_Two": "a) Disclosure to a third party having gained your prior consent;<br>b) Information must be shared with a third party in order to provide you with products and services you have requested;<br>c) Disclosure to a third party or to an administrative or judicial authority in accordance with provisions of laws, or the requirements of an administrative or judicial authority;<br>d) If a situation arises in which relevant laws, regulations, or the ONEROOT DEX services agreement are contravened, it will be necessary to make disclosures to a third party;<br>e) If you are a qualified intellectual property complainant and have already filed a complaint, disclosure will be made to the respondent at the respondent’s request to facilitate the handling two of the possible rights dispute by the two side;<br>f) In other situations, disclosure should be on the basis of laws, regulations, or that which is considered appropriate disclosure according to website policy."
    },
    "AboutUs":{
        "DEX":"ONEROOT DEX",
        "Oneroot":"ONEROOT DEX is a decentralized exchange based on the R1 protocol, which is guaranteeing the security of user assets while providing the transaction speed and experiences comparable to the centralized exchange. Due to the sharing feature of R1, ONEROOT DEX can share order data and liquidity with all decentralized exchanges accessing R1, such as Bithumb DEX, thus providing users with better trading depth."
    }
}
